Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོར་ནི་སྒོ་མེད་པའི་ཕྱིར་
en: Because in this way there are no gateways with regard to the gateways of all Dharma teachings,

source: སྒོ་དེ་ནི་འབྱུང་བའི་སྒོ་མ་ཡིན། འཇུག་པའི་སྒོ་མ་ཡིན། སོང་བའི་སྒོ་མ་ཡིན། བརྗོད་པའི་སྒོ་མ་ཡིན་ཏེ།
en: such gateways are not gateways of emergence, gateways of entry, gateways of departure, or gateways of expression;

source: མཐར་མི་སྐྱེ་བའི་སྒོ་ཞེས་བྱའོ། །
en: ultimately, they are called the unborn gateway .

source: ཆོས་ཀྱི་སྒོ་དེས་ན་ཆོས་ཐམས་ཅད་ལ་ཤེས་པ་མེད། མཐོང་བ་མེད་དོ། །
en: Through this Dharma gateway, no phenomenon is known or seen.

source: ཆོས་ཀྱི་སྒོ་དེ་ནི་ཆོས་ལ་རིག་པ་ཡང་མེད། འཇུག་པ་ཡང་མེད་དོ། །
en: This Dharma gateway involves no understanding of, or entry into, Dharma teachings.

source: རིགས་ཀྱི་བུ་དག་ཆོས་ཐམས་ཅད་ལ་སྒོ་མེད་དེ་
en: “Noble children, there are no gateways of Dharma teachings,

source: སྒོར་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because gateways cannot be observed.

source: ནམ་མཁའ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: Space is a gateway of all Dharma teachings,

source: ཐོག་མ་ནས་རང་བཞིན་གྱིས་རྣམ་པར་དག་པའི་ཕྱིར་རོ། །
en: because it is primordially pure by nature.

source: ཆད་པ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: The absence of discontinuity is a gateway of all Dharma teachings,

source: ཆད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because discontinuity cannot be observed.

source: མཐའ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: The absence of limits is a gateway of all Dharma teachings,

source: མཐར་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because limits cannot be observed.

source: ཚད་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: The absence of measures is a gateway of all Dharma teachings,

source: ཚད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because measures cannot be observed.

source: མུ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: The absence of bounds is a gateway of all Dharma teachings,

source: མུ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because bounds cannot be observed.

source: རིགས་ཀྱི་བུ་དག་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དག་གང་ཞིག་ཆོས་ཀྱི་སྒོ་འདིར་ཞུགས་ན་
en: Noble children, if a noble son or daughter enters this Dharma gateway,

source: ཆོས་ཐམས་ཅད་ཀྱི་སྒོར་ཞུགས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟོན་པ་ཞེས་བྱའོ། །
en: it is said that they enter the gateway of all Dharma teachings, understand the gateway of all Dharma teachings, and reveal the gateway of all Dharma teachings.”

source: གླེང་གཞིའི་ལེའུ་སྟེ་གཅིག་གོ། །།
en: This was chapter one:“ The Introduction .”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་འཛིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then addressed the bodhisattva Lokadhara,

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཞིག་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ཐོབ་པར་འདོད་པ་དང་། ཆོས་རྣམ་པར་འབྱེད་པའི་མཚན་ཉིད་ལ་མཁས་པར་འདོད་པ་དང་། གང་དྲན་པའི་སྟོབས་ཐོབ་པར་འདོད་པ་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པའི་ཤེས་རབ་ཐོབ་པར་འདོད་པ་དང་། གང་འདི་ལུས་འདི་བོར་ནས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་པའི་དྲན་པ་ཐོབ་པར་འདོད་པ་དག་ཆོས་ཀྱི་སྒོ་འདི་ལ་མྱུར་དུ་འཇུག་པར་བྱའོ། །
en: “Lokadhara, bodhisattva great beings who wish to attain the true characteristics of all phenomena, wish to be learned in the characteristics of discerning phenomena, wish to attain the power of recall, wish to attain the insight that discerns all phenomena, or wish to attain unbroken mindfulness from the time they leave this body until reaching unsurpassed and perfect awakening should swiftly enter this Dharma gateway.

source: ཆོས་ཀྱི་སྒོ་འདིས་ཤེས་རབ་ཀྱི་སྣང་བ་ཐོབ་པར་འགྱུར་རོ། །
en: Through this Dharma gateway, they will attain the light of insight.

source: ཆོས་ཀྱི་སྒོ་འདིས་ནི་མྱུར་དུ་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པའི་ཕྱིར་རོ། །
en: Because this Dharma gateway swiftly ensures that perfection is attained.

source: གཞན་ཡང་འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཀྱི་སྒོ་འདི་ལ་ནན་ཏན་དུ་བརྩོན་པར་བྱའོ། །
en: Furthermore, Lokadhara, bodhisattva great beings should exert themselves in this Dharma gateway.

source: གང་ཆོས་ལ་སྦྱོར་བའི་སྒོ་འདི་ལ་ཞུགས་པ་ནི་ཕུང་པོ་ལ་སྦྱོར་བ་དང་། ཁམས་ལ་སྦྱོར་བ་དང་། སྐྱེ་མཆེད་ལ་སྦྱོར་བ་དང་། རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བའི་ཆོས་ལ་སྦྱོར་བ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་སྦྱོར་བ་དང་། དབང་པོ་ལྔ་ལ་སྦྱོར་བ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྦྱོར་བ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ལ་སྦྱོར་བ་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་ཤིང་།
en: Having entered this gateway that pertains to the Dharma, they will become highly skilled in discerning what pertains to the aggregates, elements, sense sources, dependently originated phenomena, the four applications of mindfulness, the five powers, the eightfold path of the noble ones, and mundane and transcendent phenomena.

source: གཞན་ཡང་འདུས་བྱས་དང་། འདུས་མ་བྱས་པའི་ཆོས་ལ་སྦྱོར་བ་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པར་འགྱུར་རོ། །
en: Additionally, they will become highly skilled in discerning what pertains to conditioned and unconditioned phenomena.”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་ཕུང་པོ་ལྔ་ལ་སྦྱོར་བ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་གང་ཞེ་ན།
en: “Lokadhara, how are bodhisattvas skilled in discerning what pertains to the five aggregates?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་ཡང་དག་པར་རྟོག་པ་ནི་འདི་ལྟ་སྟེ།
en: Bodhisattva great beings correctly understand the five aggregates for appropriation in the following way:

source: མ་རིག་པའི་ཕུང་པོ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོའོ། །
en: The aggregates for appropriation are heaps of ignorance.

source: སྡུག་བསྔལ་གྱི་ཕུང་པོ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོའོ། །
en: The aggregates for appropriation are heaps of suffering.

source: གཏི་མུག་གི་ཕུང་པོ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོའོ། །
en: The aggregates for appropriation are heaps of delusion.

source: ནད་ཀྱི་ཕུང་པོ་དང་། ཤུ་བའི་ཕུང་པོ་དང་། ཟུག་རྔུའི་ཕུང་པོ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔའོ། །
en: The aggregates for appropriation are heaps of sickness, boils, and thorns.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཟུགས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་བརྟག་པར་བྱའོ། །
en: Bodhisattvas should contemplate the discernment of the aggregate for appropriation of form.

source: དེ་ལ་གཟུགས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་ཇི་ལྟར་བརྟག་ཅེ་ན།
en: How then should they contemplate the discernment of the aggregate for appropriation of form?

source: གཟུགས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་དེ་ནི་ཆེན་པོ་བཞི་ལས་སྐྱེས་པ་སྟེ།
en: The aggregate for appropriation of form arises from the four great elements, so

source: གཟུགས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ཞེས་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: the aggregate for appropriation of form is actually nothing more than a mere imputation.

source: གཟུགས་ཀྱི་ཕུང་པོ་ལ་རང་བཞིན་མེད་དེ་ཆེན་པོ་བཞི་འདུས་པར་ཟད་པས་
en: As the aggregate of form is without intrinsic nature and is simply a gathering of the four great elements,

source: གཟུགས་ཀྱི་ཕུང་པོ་ཞེས་བཏགས་པ་ཙམ་མོ། །
en: the aggregate of form is a mere imputation.

source: གཟུགས་ཀྱི་ཕུང་པོ་ནི་བྱས་པ་མེད་པ། བྱེད་པ་མེད་པ། བྱ་བ་མེད་པ། འབྱུང་བ་མེད་པའོ། །
en: The aggregate of form was not created, is not created, will not be created, and does not arise.

source: གཟུགས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་ནི་སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་དང་། རྐྱེན་དང་། ཆེན་པོ་བཞི་འདུས་པ་ལས་གཟུགས་ཀྱི་ཕུང་པོ་ཞེས་བཏགས་པ་ཙམ་དུ་ཟད་ཀྱི་ཕུང་པོ་མ་ཡིན་པ་དེ་གཟུགས་ཀྱི་ཕུང་པོ་ཡིན་ནོ། །
en: The aggregate of form is nothing but a mere imputation, based upon the causes and conditions of past actions and the gathering of the four great elements. Apart from the mere imputation, it is not an aggregate. Such is the aggregate of form.

source: དཔེར་ན་ནམ་མཁའི་ཕུང་པོ་དང་འདྲ་སྟེ་ཡང་དག་པ་སྐྱེ་བའི་མཚན་ཉིད་མེད་དོ། །
en: To draw an analogy, it is like the aggregate of space, as it does not have any characteristic of true arising.

source: གང་ནམ་མཁའི་ཕུང་པོ་ཞེས་བརྗོད་པ་དེ་ལ་ཆོས་གང་ཡང་མ་སྐྱེས་ཏེ་
en: In what is described as the aggregate of space , no phenomenon whatsoever has arisen.

source: མིང་ཙམ་ཡོད་པའི་ཕྱིར་ནམ་མཁའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Still, because it has the mere label, it is called the aggregate of space .

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོས་ཕུང་པོ་དང་ཕུང་པོའི་མཚན་ཉིད་མེད་པ་འདི་ལ་ཕྱིན་ཅི་ལོག་གི་སེམས་ཀྱིས་ཡང་དག་པ་མ་ཡིན་པར་ཡང་དག་པར་འཛིན་ཏེ།
en: Childish ordinary beings hold what is false to be true, with their erroneous thoughts about the nonexistent aggregates and their characteristics, such that

source: བདག་ཕུང་པོ་ལྔའོ། །བདག་གི་བ་ཕུང་པོ་ལྔའོ། །བདག་གཟུགས་ཀྱི་ཕུང་པོའོ། །བདག་གི་གཟུགས་ཀྱི་ཕུང་པོ་ཞེས་དེ་ལྟར་ཞེན་ཏོ། །
en: they cling to notions like ‘I am the five aggregates,’ ‘my five aggregates,’ ‘I am the aggregate of form,’ and ‘my aggregate of form.’

source: དེ་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་གཟུགས་ལ་ཞེན་ནས་གཟུགས་ལ་བདག་དང་། བདག་གི་བ་དང་། གཟུགས་ཡོད་པ་དང་། གཟུགས་སུ་འཛིན་པ་དང་། གཟུགས་སུ་ལེན་པ་དང་། གཟུགས་ལ་ཞེན་པ་དག་གཟུགས་ལ་གནས་ཤིང་རྟེན་ཏེ་སྡིག་པ་མི་དགེ་བའི་ལས་རྣམ་པ་སྣ་ཚོགས་སྤྱོད་ཅིང་མྱོང་བར་བྱེད་དོ། །
en: Thereby, in clinging to form, childish ordinary beings think of form as being themselves, something belonging to them, or something existent, perceptible, adoptable, or obtainable. They dwell on and depend upon form, and so they engage in and experience myriad nonvirtuous and evil actions.

source: བདག་ཅག་གིས་ནི་བུས་པ་སོ་སོའི་སྐྱེ་བོའི་རྗེས་སུ་བསླབ་པའི་མི་རིགས་ཀྱི་བདག་ཅག་གིས་བརྩོན་འགྲུས་བསྐྱེད་དེ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་བསྒོམ་པ་ལ་ནན་ཏན་བྱའོ། །
en: “It is inappropriate for us to emulate childish ordinary beings, for we should arouse diligence and earnestly cultivate the factors of awakening.

source: གཟུགས་ཀྱི་ཕུང་པོ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་བརྟག་པར་བྱ་བའི་རིགས་སོ། །
en: It is appropriate for us to investigate the aggregate of form accurately.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕུང་པོ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་པའི་ཚེ་ཆུའི་དབུ་བ་དང་འདྲ་བར་ཤེས་སོ། །
en: When bodhisattvas contemplate the aggregates accurately, they understand them to be like water bubbles.

source: དེ་ལ་ཇི་ལྟར་ན་ཆུའི་དབུ་བ་དང་འདྲ་བར་ཤེས་པ་ཞེ་ན།
en: How do they understand them to be like water bubbles?

source: དབུ་བ་མེད་པ་ནི་ཆུའི་དབུ་བ་སྟེ། དེ་ཡང་རྐྱེན་མང་པོ་ལས་སྐྱེས་སུ་ཟད་ཀྱི་བཟུང་ཞིང་བཅང་དུ་མི་བཟོད།
en: A water bubble does not exist—for it simply occurs due to many conditions and cannot be grasped or held. It is without solidity or a core.

source: སྲ་བའམ་སྙིང་པོ་མེད་པས་ཆུའི་དབུ་བ་དེ་ལ་དབུ་བའི་མཚན་ཉིད་མེད་དེ།
en: For these reasons, water bubbles lack any characteristics of bubbles.

source: གང་དབུ་བ་མེད་པ་ལ་ཆུའི་དབུ་བ་ཞེས་བྱ་བ་བཞིན་དུ་གཟུགས་ཀྱི་ཕུང་པོ་ཡང་དེ་དང་འདྲ་སྟེ།
en: Just as the absence of a real bubble can be called a water bubble , so it is with the aggregate of form, for

source: གཟུགས་ཀྱི་ཕུང་པོ་ལ་ཕུང་པོའི་མཚན་ཉིད་མེད་དོ། །
en: the aggregate of form lacks the characteristics of an aggregate.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལྟར་རྟོག་པའི་ཚེ་འདི་སྙམ་དུའང་བུས་པ་སོ་སོའི་སྐྱེ་བོ་ནི་ཡང་དག་པ་མ་ཡིན་པའི་གཟུགས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མི་རྟོགས།
en: When bodhisattvas contemplate this, they reflect as follows: ‘Childish ordinary beings fail to understand the unreal nature of form accurately;

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་གཟུགས་མི་རྟག་པར་མི་ཤེས།
en: they do not understand the impermanence of form accurately;

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་མི་ཤེས་སོ་སྙམ་ནས།
en: and they do not understand the characteristic of form accurately.

source: བདག་ཅག་ཡང་དག་པའི་ལམ་ལ་ཞུགས་པས་ཡང་དག་པ་མ་ཡིན་པའི་གཟུགས་ལ་ཞེན་པར་མི་བྱའོ། །
en: However, we have entered the correct path, so we shall not cling to unreal forms.

source: གཟུགས་ཞེན་པར་བྱ་བའི་མཚན་ཉིད་མ་ཡིན་ཏེ།
en: Form does not have any characteristic to grasp at, for

source: མིང་ཙམ་དུ་ཟད་ཀྱི་ངེས་པའི་མཚན་ཉིད་མེད་དོ། །
en: it is just a mere label, lacking any true characteristics.

source: དེ་ལྟར་གཟུགས་ནི་ངེས་པའི་མཚན་ཉིད་མེད་ཅིང་མིང་དང་ཡང་བྲལ་བའི་ཕྱིར་གཟུགས་ཞེས་བྱའོ། །
en: Thus, because form lacks a true characteristic and has no name, it is called form .

source: ཡང་གཞན་དུ་ན་གཟུགས་ནི་འཇིག་པའི་མཚན་ཉིད་ཡིན་ཏེ།
en: Furthermore, form has the characteristic of being destructible, yet

source: མཁས་པ་དག་གིས་ནི་ཁོང་དུ་ཆུད་པས་མཚན་མ་མེད་པར་ཤེས་སོ། །
en: the wise understand it as lacking marks.

source: བདག་ཅག་གིས་གཟུགས་མཚན་མ་མེད་པའི་སྦྱོར་བ་བསྒོམ་པ་ལ་མཁས་པར་བྱའི། གཟུགས་ཀྱི་མཚན་མ་ལ་ཞེན་པར་མི་བྱའོ། །
en: We must become skilled in cultivating the practice that form has no marks—we should not cling to the marks of form.

source: གང་ཟག་གང་ཞིག་གཟུགས་ཀྱི་མཚན་མ་ལ་ཞེན་ན་གཟུགས་ལ་ཞེན་པ་ཞེས་བྱའོ། །
en: If a person clings to the marks of form, they are called one who clings to form .

source: བདག་ཅག་གིས་གཟུགས་ཀྱི་མཚན་མར་འཇུག་པ་ལ་ཤིན་ཏུ་མཁས་པར་བྱའོ། །
en: We should become highly skilled in understanding the marks of form.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་རྟོག་པ་དེའི་ཚེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་གཟུགས་རྣམ་པར་འབྱེད་པ་རྟོགས་ནས་གཟུགས་ཀྱི་ཕུང་པོ་དེ་ཡང་གང་བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་གིས་རྣམ་པར་བརྟགས་པའི་འདུ་ཤེས་ལས་བྱུང་བར་ཤེས་སོ། །
en: When bodhisattvas understand this accurately, they know how to discern form accurately. At that point, they know that the aggregate of form arises from the imputations of childish ordinary beings.

source: དེ་ལྟར་ཆོས་རྣམས་རྣམ་པར་བརྟགས་པའི་འདུ་ཤེས་ལས་བྱུང་བས་དེ་ནི་མ་སྐྱེས་པ་སྟེ།
en: The fact that phenomena arise from imputation means that they are unborn.

source: རྣམ་པར་བརྟགས་པའི་འདུ་ཤེས་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་པའི་བུས་པ་སོ་སོའི་སྐྱེ་བོ་ཕྱིན་ཅི་ལོག་ལ་རྟེན་ཅིང་གནས་ནས་གཟུགས་ཞེས་སྐྱེད་དེ། གཟུགས་ཀྱིས་རྣམ་པར་བཅིངས་སོ། །
en: Since all imputations are rooted in and based on the mistaken and false understanding of childish ordinary beings, beings give rise to such forms and become bound by those forms.

source: གཟུགས་ཀྱིས་གཙེས་པས་སྡུག་བསྔལ་གྱིས་གདུངས་ཏེ་འཁོར་བར་གྱུར་ཏོ། །
en: Tormented by form, they are pained by suffering and wander throughout saṃsāra.

source: མ་རིག་པ་དང་གཏི་མུག་གིས་ལྡོངས་པས་གཟུགས་སུ་ཞེན་ཏེ་མི་གཏོང་ནས་
en: Blinded by ignorance and delusion, they cling to form and cannot let it go; thereby,

source: གཟུགས་ལ་རྟག་པ་དང་། སྲ་བ་དང་། སྙིང་པོ་ཡོད་པར་ལྟ་བས་དེ་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་གཟུགས་ཀྱི་འཆིང་བས་བཅིངས་ཏེསེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་དང་། ཡི་དགས་དང་། ལྷ་དང་མིར་རྒྱུན་དུ་འཁོར་རོ། །
en: they regard form as permanent, solid, and having a core. Through this, childish ordinary beings are bound by the fetters of form and wander constantly through the realms of hell beings, animals, anguished spirits, gods, and humans.

source: གཟུགས་ཀྱི་རོ་ལ་ཤིན་ཏུ་ཆགས་ཏེ།
en: They relish the experience of form, for

source: གཟུགས་དེ་ལ་ཉེས་པའི་སྐྱོན་མང་པོ་ཡོད་པར་མི་ལྟའོ། །
en: they do not consider the many problems inherent in form.

source: བདག་ཅག་གིས་བུས་པ་སོ་སོའི་སྐྱེ་བོའི་རྗེས་སུ་བསླབ་པར་མི་བྱའི། གཟུགས་ཀྱི་སྦྱོར་བ་རྣམ་པར་འབྱེད་པ་བསྒོམ་པ་ལ་བརྟག་པར་བྱའོ། །
en: We should not emulate childish ordinary beings; rather, we should cultivate discernment regarding what pertains to form.’

source: གཟུགས་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་པའི་ཚེ་གཟུགས་ཀྱི་རང་བཞིན་རྨི་ལམ་དང་འདྲ་བར་མཐོང་ངོ་། །
en: “When cultivating discernment of form, one should view form’s nature as being like a dream.

source: རྨི་ལམ་གྱི་ནང་ན་གཟུགས་མཐོང་བ་དེ་ནི་རྣམ་པར་བརྟགས་པའི་འདུ་ཤེས་ཚོར་བ་དང་། རྟོག་པ་ལས་སྐྱེས་ཏེ། མཐོང་བ་དང་། ཐོས་པ་དང་། ཚོར་བ་དང་། ཤེས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་སྐྱེད་དེ་
en: In a dream, the forms one sees arise from imputed perceptions, feelings, and concepts, which arouse sights, sounds, feelings, perceptions, and dependent origination.

source: བདག་དང་གཞན་དུ་ཡང་ཤེས་སོ། །
en: One then perceives these as self and other.

source: ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དུ་ཡང་མཐོང་ངོ་། །
en: One sees them as earth, water, fire, and wind.

source: རི་དང་། ཆུ་དང་། ནགས་ཚལ་ལ་སོགས་པར་མཐོང་སྟེ། དེ་ལྟར་རྨི་ལམ་གྱིས་གཟུགས་ཀྱི་མཚན་མ་དེ་ལ་ངེས་པར་ཆད་པ་མེད་དེ་རྣམ་པར་བརྟགས་པའི་འདུ་ཤེས་ལས་གཟུགས་ཀྱི་ཕུང་པོའི་མཚན་མར་སྐྱེད་པ་ཡང་དེ་བཞིན་ཏེ། སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་དང་རྐྱེན་ལས་སྐྱེས་ཏེ་ངེས་པའི་རང་བཞིན་ཅན་མ་ཡིན་ནོ། །
en: One sees them as mountains, lakes, forests, and so on. In this fashion, the marks of the forms in a dream do not truly exist; rather, they come about based on imputed perceptions. The marks of the aggregate of form are produced in the same way; they arise from the causes and conditions of previous actions and do not have a defined nature.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལྟར་ཡིད་ལ་བྱེད་པ་ན་གཟུགས་ལ་བདག་གམ་བདག་གི་བར་མི་ལེན་ཏོ། །
en: If bodhisattvas contemplate in this fashion, they will not appropriate form as either I or mine .

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་གཟུགས་ལ་རྟོག་སྟེ།
en: They will contemplate form accurately.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མི་རྟག་པའི་མཚན་ཉིད་དང་། ཡང་དག་པ་མ་ཡིན་པ་ཕྱིན་ཅི་ལོག་ཏུ་རྟོག་གོ། །
en: They will accurately understand its characteristic of impermanence and its false and mistaken nature.

source: སེམས་ཅན་དག་ནི་ཕྱིན་ཅི་ལོག་གིས་བསླད་པའི་གཟུགས་ལ་བདག་གཟུགས། བདག་གི་གཟུགས། གཞན་གཟུགས། གཞན་གྱི་གཟུགས་སུ་ཞེན་ཅིང་འཛིན་ཏོ། །
en: Beings, however, grasp and cling to this incorrectly observed form and perceive it as I, mine, other , or other’s .

source: དེ་ལྟར་གཟུགས་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་པའི་ཚེ་གཟུགས་སུ་མི་དམིགས།
en: When bodhisattvas discern form in this way, they do not observe it as form;

source: གཟུགས་ཀྱི་རང་བཞིན་མི་མཐོང་།
en: they do not see it as having the nature of form;

source: གཟུགས་མི་རྟག་པ་ལ་ཡང་མི་ཆགས་སོ། །
en: and they do not become attached to impermanent forms.

source: བྱང་ཆུབ་སེམས་དཔས་དེའི་ཚེ་གཟུགས་ལ་ཆགས་པ་དང་འཛིན་པ་ཐམས་ཅད་བསལ་ཏེ་མེད་པར་གྱུར་ན་
en: At that time, if they dispel and eliminate all attachment and grasping to form,

source: གཟུགས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་ཡིན།
en: they will become highly skilled concerning the true characteristics of form;

source: གཟུགས་མཉམ་པའི་མཚན་ཉིད་ཤེས་པ་ཡིན།
en: they will understand form’s characteristic of sameness;

source: གཟུགས་འགོག་པའི་མཚན་ཉིད་ཤེས་པ་ཡིན།
en: they will understand form’s characteristic of cessation;

source: གཟུགས་འགོག་པའི་ལམ་གྱི་མཚན་ཉིད་ལ་མཁས་པ་ཡིན།
en: they will become skilled concerning form’s characteristic of the path that leads to cessation;

source: གཟུགས་ཀྱི་ཕུང་པོ་གང་ནས་ཀྱང་མ་འོངས་པ། གང་དུའང་མི་འགྲོ་བར་རབ་ཏུ་རྟོགས་སོ། །
en: they will realize that the aggregate of form does not come from anywhere or go anywhere.

source: དེ་ལྟར་རྟོག་པའི་ཚེ་ན་ལུས་དང་གཟུགས་ཀྱི་ཕུང་པོ་དེ་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་དང་། རྣམ་པར་བརྟགས་པ་ལས་སྐྱེས་ཏེ། ཆེན་པོ་བཞི་འདུས་པ་ལས་བྱུང་བར་ཤེས་སོ། །
en: When contemplating in this way, they understand that the body and the aggregate of form are born from the ripening of karmic results and imputations, and that they arise from the gathering of the four great elements.

source: ལུས་ཀྱི་གཟུགས་ཀྱི་ཕུང་པོ་ནི་བདག་མ་ཡིན། གཞན་མ་ཡིན། བདག་པོ་མེད་དེ་གང་ནས་ཀྱང་མ་འོངས་སོ། །
en: The aggregate of physical form is not the self, not another, ownerless, and does not come from anywhere.

source: གཟུགས་ཀྱི་ཕུང་པོ་ལ་དེ་ལྟར་རྟོག་པས་ནང་གི་གཟུགས་ལ་མི་ཆགས། མི་ལེན། ཕྱིའི་གཟུགས་ལ་མི་ཆགས། མི་ལེན། འདས་པའི་གཟུགས་ལ་མི་ཆགས། མི་ལེན། མ་འོངས་པའི་གཟུགས་ལ་མི་ཆགས། མི་ལེན། ད་ལྟའི་གཟུགས་ལ་ཡང་མི་ཆགས། མི་ལེན་ཏེ། གཟུགས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་ལ་མ་སྐྱེས་པའི་མཚན་ཉིད་དུ་ཤེས་སོ། །
en: Having contemplated the aggregate of form in this fashion, they will not grasp or become attached to inner forms, outer forms, past forms, future forms, or present forms, as they understand all aggregates of form in terms of their characteristic of being unborn.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཚེ་གཟུགས་མི་འགག་གཟུགས་འགགས་པའི་ཆོས་ཚོལ་ལོ། །
en: These bodhisattvas then neither negate form nor seek a Dharma that negates form.

source: འཇིག་རྟེན་འཛིན་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གཟུགས་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་པ་ཞེས་བྱའོ། །
en: Lokadhara, for these reasons, bodhisattva great beings are called those who engage in the discernment of form .”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཚོར་བ་ཉེ་བར་ལེན་པའི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་པ་ཡིན་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings engage in the discernment of the aggregate for appropriation of feeling?

source: བྱང་ཆུབ་སེམས་དཔས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Bodhisattvas think:

source: བདེ་བར་ཚོར་བ་དང་། སྡུག་བསྔལ་དུ་ཚོར་བ་དང་། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པར་ཚོར་བ་འདི་ནི་རྟེན་ཅིང་འབྲེལ་པ་ལས་བྱུང་སྟེ། རྒྱུ་དང་རྐྱེན་ལ་རག་ལུས་པས་
en: ‘Pleasurable feelings, painful feelings, and feelings that are neither pleasurable nor painful arise through dependent origination and are based on causes and conditions. Therefore,

source: ཚོར་བའི་མཚན་ཉིད་ལ་ཞུགས་ན།
en: if one has understood the characteristic of feeling,

source: དེ་ལ་ཚོར་བར་བྱེད་པ་མེད་དེ་ཞེན་པ་ཙམ་དུ་ཟད་དོ། །
en: there is no feeling there, for it is simply clinging.

source: ཞེན་པ་དེ་ནི་ཡང་དག་པ་མ་ཡིན་ཏེ། ཡང་དག་པ་མ་ཡིན་པའི་ཀུན་ཏུ་བརྟགས་པ་ལས་སྐྱེས་པའོ། །
en: Such clinging is false and arises from false imputations.’

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དེ་སྙམ་དུ་སེམས་པ་ན་ཡང་འདི་སྙམ་དུ་
en: When bodhisattvas think such, they will also think,

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་ནི་ཡང་དག་པ་མ་ཡིན་པའི་ཀུན་ཏུ་རྟོག་པའི་ཚོར་བས་བཅིངས་ནས་ཚོར་བ་རྣམ་པ་གསུམ་གྱིས་རྣམ་པར་གཙེས་སོ། །འདི་ལྟ་སྟེ། བདེ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་རྣམས་སོ། །
en: ‘Childish ordinary beings, bound by falsely imputed feelings, are tormented by the three types of feeling: pleasurable feelings, painful feelings, and feelings that are neither pleasurable nor painful.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་གལ་ཏེ་བདེ་བར་ཚོར་བ་ན་འདོད་པའི་ཉོན་མོངས་པས་བཀོལ་ཏེ།
en: When childish ordinary beings experience pleasurable feelings, they become bound by the affliction of desire.

source: འདོད་པའི་ཉེ་བའི་ཉོན་མོངས་པས་ཉོན་མོངས་པའི་ཕྱིར་མི་དགེ་བའི་ལས་རྣམ་པ་སྣ་ཚོགས་སྐྱེད་དོ། །
en: Because they are afflicted by desire’s secondary afflictions, they engage in various nonvirtuous actions.

source: གལ་ཏེ་སྡུག་བསྔལ་དུ་ཚོར་བ་ན་ཞེ་སྡང་གི་ཉོན་མོངས་པས་བཀོལ་ཏེ།
en: When they experience unpleasant feelings, they become bound by the affliction of aggression.

source: ཞེ་སྡང་གི་ཉེ་བའི་ཉོན་མོངས་པས་ཉོན་མོངས་པའི་ཕྱིར་མི་དགེ་བའི་ལས་རྣམ་པ་སྣ་ཚོགས་སྐྱེད་དོ། །
en: Because they are afflicted by aggression’s secondary afflictions, they engage in various nonvirtuous actions.

source: གལ་ཏེ་བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ན་མ་རིག་པའི་ཉོན་མོངས་པས་བཀོལ་ཏེ།
en: When they experience feelings that are neither pleasurable nor painful, they become bound by the affliction of ignorance.

source: མ་རིག་པའི་ཉེ་བའི་ཉོན་མོངས་པས་ཉོན་མོངས་པའི་ཕྱིར་སློས་པའི་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་གྱིས་གདུངས་པ་ལས་རྣམ་པར་མ་གྲོལ་བར་གྱུར་ཏོ། །
en: Because they are afflicted by ignorance’s secondary afflictions, they are not freed from misery, lamentation, and painful torment.

source: བདག་གིས་བུས་པ་སོ་སོའི་སྐྱེ་བོའི་རྗེས་སུ་བསླབ་པར་མི་བྱའི། ཆོས་རྣམས་ཀྱི་ཡང་དག་པ་ཉིད་ལ་བརྟག་པར་བྱའོ། །
en: We should not emulate childish ordinary beings. Rather we should investigate the true reality of phenomena.

source: བདག་ཅག་གིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཚོར་བ་ལ་བརྟག་པར་བྱའོ། །
en: We should investigate feeling accurately.’

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཚོར་བའི་ཕུང་པོ་ལ་བརྟགས་ནས་ཡང་འདི་སྙམ་དུ་
en: “Once bodhisattvas have investigated the aggregate of feelings accurately, they will think,

source: ཕུང་པོ་མ་ཡིན་པ་ནི་ཚོར་བའི་ཕུང་པོ་སྟེ།
en: ‘The aggregate of feelings is not an aggregate.

source: རྣམ་པར་བརྟག་པ་ལས་སྐྱེས་པ་ཕྱིན་ཅི་ལོག་དང་ལྡན་པའི་ཚོར་བ་བྱེད་པ་མེད་དེ།
en: Feelings arise from false imputation, and they are devoid of action.

source: སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་ལས་སྐྱེས་སོ། །ད་ལྟར་གྱི་རྐྱེན་གྱིས་ཚོར་བ་རྣམས་མྱོང་སྟེ།
en: Feelings arise from the cause of past actions and are experienced based upon conditions in the present moment.

source: རང་བཞིན་གྱིས་སྟོང་པས་ཚོར་བ་ལས་ཚོར་བའི་མཚན་མ་མེད་དོ། །
en: Because feelings are naturally empty, they lack the marks of feelings.’

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཚོར་བའི་ཕུང་པོ་ལ་རྟོག་པ་ན་
en: When bodhisattvas contemplate the aggregate of feeling,

source: ཆུའི་ཆུ་བུར་ལྟ་བུར་སྐྱེས་ནས་འགགས་ཏེ་ངེས་པར་ཆད་པ་མེད་པར་ཆུད་པ་བཞིན་ཚོར་བའི་ཕུང་པོ་ཡང་དེ་དང་འདྲ་སྟེ
en: they see that the aggregate of feelings is like water bubbles that appear and cease without ever truly existing.

source: རྒྱུ་དང་རྐྱེན་འབྲེལ་པ་ལས་སྐྱེས་ཏེ། རྒྱུ་དང་རྐྱེན་ལ་རག་ལས་པས་སྐད་ཅིག་ཀྱང་མི་གནས་ཏེ།
en: They arise from the connections between causes and conditions, and they depend on causes and conditions. Hence, they do not remain, even momentarily.
